# Parameter Filter Rule Factory Create Less Or Equal Rule Method

Source: https://www.revitapidocs.com/2026/5b6d084a-a18a-467a-6f4a-10790e1a71fe.htm

---

| Parameter Filter Rule Factory Create Less Or Equal Rule Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | CreateLessOrEqualRule(ElementId, ElementId) | Creates a filter rule that determines whether ElementId values  from the document are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, Int32\) | Creates a filter rule that determines whether integer values  from the document are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, String) | Creates a filter rule that determines whether strings from the document  are less than or equal to a certain value. |
|  | CreateLessOrEqualRule(ElementId, Double, Double) | Creates a filter rule that determines whether double\-precision values  from the document are less than or equal to a certain value. |

Top See Also

#### Reference

ParameterFilterRuleFactory Class Autodesk.Revit.DB Namespace